# Data - an introduction to the world of Pandas

**Note:** This is an edited version of [Cliburn Chan's](http://people.duke.edu/~ccc14/sta-663-2017/07_Data.html) original tutorial, as part of his Stat-663 course at Duke.  All changes remain licensed as the original, under the terms of the MIT license.

Additionally, sections have been merged from [Chris Fonnesbeck's Pandas tutorial from the NGCM Summer Academy](https://github.com/fonnesbeck/ngcm_pandas_2017/blob/master/notebooks/1.%20Introduction%20to%20NumPy%20and%20Pandas.ipynb), which are licensed under [CC0 terms](https://creativecommons.org/share-your-work/public-domain/cc0) (aka 'public domain').

## Resources

- [The Introduction to Pandas chapter](http://proquest.safaribooksonline.com/9781491957653/pandas_html) in the Python for Data Analysis book by Wes McKinney is essential reading for this topic.  This is the [companion notebook](https://github.com/wesm/pydata-book/blob/2nd-edition/ch05.ipynb) for that chapter.
- [Pandas documentation](http://pandas.pydata.org/pandas-docs/stable/)


## Pandas

**pandas** is a Python package providing fast, flexible, and expressive data structures designed to work with *relational* or *labeled* data both. It is a fundamental high-level building block for doing practical, real world data analysis in Python. 

pandas is well suited for:

- **Tabular** data with heterogeneously-typed columns, as you might find in an SQL table or Excel spreadsheet
- Ordered and unordered (not necessarily fixed-frequency) **time series** data.
- Arbitrary **matrix** data with row and column labels

Virtually any statistical dataset, labeled or unlabeled, can be converted to a pandas data structure for cleaning, transformation, and analysis.


### Key features
    
- Easy handling of **missing data**
- **Size mutability**: columns can be inserted and deleted from DataFrame and higher dimensional objects
- Automatic and explicit **data alignment**: objects can be explicitly aligned to a set of labels, or the data can be aligned automatically
- Powerful, flexible **group by functionality** to perform split-apply-combine operations on data sets
- Intelligent label-based **slicing, fancy indexing, and subsetting** of large data sets
- Intuitive **merging and joining** data sets
- Flexible **reshaping and pivoting** of data sets
- **Hierarchical labeling** of axes
- Robust **IO tools** for loading data from flat files, Excel files, databases, and HDF5
- **Time series functionality**: date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging, etc.

In [68]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [69]:
plt.style.use('seaborn-dark')

## Working with Series

* A pandas Series is a generationalization of 1d numpy array
* A series has an *index* that labels each element in the vector.
* A `Series` can be thought of as an ordered key-value store.

In [70]:
np.array(range(5,10))

array([5, 6, 7, 8, 9])

In [71]:
x = Series(range(5,10))

In [72]:
x

0    5
1    6
2    7
3    8
4    9
dtype: int64

### We can treat Series objects much like numpy vectors

In [73]:
x.sum(), x.mean(), x.std()

(35, 7.0, 1.5811388300841898)

In [74]:
x**2

0    25
1    36
2    49
3    64
4    81
dtype: int64

In [75]:
x[x >= 8]

3    8
4    9
dtype: int64

### Series can also contain more information than numpy vectors

#### You can always use standard positional indexing

In [76]:
x[1:4]

1    6
2    7
3    8
dtype: int64

#### Series index

But you can also assign labeled indexes.

In [77]:
x.index = list('abcde')
x

a    5
b    6
c    7
d    8
e    9
dtype: int64

#### Note that with labels, the end index is included

In [78]:
x['b':'d']

b    6
c    7
d    8
dtype: int64

#### Even when you have a labeled index, positional arguments still work

In [79]:
x[1:4]

b    6
c    7
d    8
dtype: int64

#### Working with missing data

Missing data is indicated with NaN (not a number).

In [80]:
y = Series([10, np.nan, np.nan, 13, 14])
y

0    10.0
1     NaN
2     NaN
3    13.0
4    14.0
dtype: float64

#### Concatenating two series

In [81]:
z = pd.concat([x, y])
z

a     5.0
b     6.0
c     7.0
d     8.0
e     9.0
0    10.0
1     NaN
2     NaN
3    13.0
4    14.0
dtype: float64

#### Reset index to default

In [82]:
z = z.reset_index(drop=True)
z

0     5.0
1     6.0
2     7.0
3     8.0
4     9.0
5    10.0
6     NaN
7     NaN
8    13.0
9    14.0
dtype: float64

In [83]:
z**2

0     25.0
1     36.0
2     49.0
3     64.0
4     81.0
5    100.0
6      NaN
7      NaN
8    169.0
9    196.0
dtype: float64

#### `pandas` aggregate functions ignore missing data

In [84]:
z.sum(), z.mean(), z.std()

(72.0, 9.0, 3.2071349029490928)

#### Selecting missing values

In [85]:
z[z.isnull()]

6   NaN
7   NaN
dtype: float64

#### Selecting non-missing values

In [86]:
z[z.notnull()]

0     5.0
1     6.0
2     7.0
3     8.0
4     9.0
5    10.0
8    13.0
9    14.0
dtype: float64

#### Replacement of missing values

In [87]:
z.fillna(0)

0     5.0
1     6.0
2     7.0
3     8.0
4     9.0
5    10.0
6     0.0
7     0.0
8    13.0
9    14.0
dtype: float64

In [88]:
z.fillna(method='ffill')

0     5.0
1     6.0
2     7.0
3     8.0
4     9.0
5    10.0
6    10.0
7    10.0
8    13.0
9    14.0
dtype: float64

In [89]:
z.fillna(method='bfill')

0     5.0
1     6.0
2     7.0
3     8.0
4     9.0
5    10.0
6    13.0
7    13.0
8    13.0
9    14.0
dtype: float64

In [90]:
z.fillna(z.mean())

0     5.0
1     6.0
2     7.0
3     8.0
4     9.0
5    10.0
6     9.0
7     9.0
8    13.0
9    14.0
dtype: float64

#### Working with dates / times

We will see more date/time handling in the DataFrame section.

In [91]:
z.index = pd.date_range('01-Jan-2016', periods=len(z))

In [92]:
z

2016-01-01     5.0
2016-01-02     6.0
2016-01-03     7.0
2016-01-04     8.0
2016-01-05     9.0
2016-01-06    10.0
2016-01-07     NaN
2016-01-08     NaN
2016-01-09    13.0
2016-01-10    14.0
Freq: D, dtype: float64

#### Intelligent aggregation over datetime ranges

In [93]:
z.resample('W').sum()

2016-01-03    18.0
2016-01-10    54.0
Freq: W-SUN, dtype: float64

#### Formatting datetime objects (see http://strftime.org)

In [94]:
z.index.strftime('%b %d, %Y')

Index(['Jan 01, 2016', 'Jan 02, 2016', 'Jan 03, 2016', 'Jan 04, 2016',
       'Jan 05, 2016', 'Jan 06, 2016', 'Jan 07, 2016', 'Jan 08, 2016',
       'Jan 09, 2016', 'Jan 10, 2016'],
      dtype='object')

### DataFrames

Inevitably, we want to be able to store, view and manipulate data that is *multivariate*, where for every index there are multiple fields or columns of data, often of varying data type.

A `DataFrame` is a tabular data structure, encapsulating multiple series like columns in a spreadsheet.  It is directly inspired by the R DataFrame.

### Titanic data

In [95]:
url = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv'
titanic = pd.read_csv(url)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [96]:
titanic.shape

(891, 15)

In [97]:
titanic.size

13365

In [98]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [99]:
# For display purposes, we will drop some columns
titanic = titanic[['survived', 'sex', 'age', 'fare',
                   'embarked', 'class', 'who', 'deck', 'embark_town',]]

In [100]:
titanic.dtypes

survived         int64
sex             object
age            float64
fare           float64
embarked        object
class           object
who             object
deck            object
embark_town     object
dtype: object

### Summarizing a data frame

In [101]:
titanic.describe()

         survived         age        fare
count  891.000000  714.000000  891.000000
mean     0.383838   29.699118   32.204208
std      0.486592   14.526497   49.693429
min      0.000000    0.420000    0.000000
25%      0.000000   20.125000    7.910400
50%      0.000000   28.000000   14.454200
75%      1.000000   38.000000   31.000000
max      1.000000   80.000000  512.329200

In [102]:
titanic.head(20)

    survived     sex   age     fare embarked   class    who deck  embark_town
0          0    male  22.0   7.2500        S   Third    man  NaN  Southampton
1          1  female  38.0  71.2833        C   First  woman    C    Cherbourg
2          1  female  26.0   7.9250        S   Third  woman  NaN  Southampton
3          1  female  35.0  53.1000        S   First  woman    C  Southampton
4          0    male  35.0   8.0500        S   Third    man  NaN  Southampton
5          0    male   NaN   8.4583        Q   Third    man  NaN   Queenstown
6          0    male  54.0  51.8625        S   First    man    E  Southampton
7          0    male   2.0  21.0750        S   Third  child  NaN  Southampton
8          1  female  27.0  11.1333        S   Third  woman  NaN  Southampton
9          1  female  14.0  30.0708        C  Second  child  NaN    Cherbourg
10         1  female   4.0  16.7000        S   Third  child    G  Southampton
11         1  female  58.0  26.5500        S   First  woman    C  Southampton
12         0    male  20.0   8.0500        S   Third    man  NaN  Southampton
13         0    male  39.0  31.2750        S   Third    man  NaN  Southampton
14         0  female  14.0   7.8542        S   Third  child  NaN  Southampton
15         1  female  55.0  16.0000        S  Second  woman  NaN  Southampton
16         0    male   2.0  29.1250        Q   Third  child  NaN   Queenstown
17         1    male   NaN  13.0000        S  Second    man  NaN  Southampton
18         0  female  31.0  18.0000        S   Third  woman  NaN  Southampton
19         1  female   NaN   7.2250        C   Third  woman  NaN    Cherbourg

In [103]:
titanic.tail(5)

     survived     sex   age   fare embarked   class    who deck  embark_town
886         0    male  27.0  13.00        S  Second    man  NaN  Southampton
887         1  female  19.0  30.00        S   First  woman    B  Southampton
888         0  female   NaN  23.45        S   Third  woman  NaN  Southampton
889         1    male  26.0  30.00        C   First    man    C    Cherbourg
890         0    male  32.0   7.75        Q   Third    man  NaN   Queenstown

In [104]:
titanic.columns

Index(['survived', 'sex', 'age', 'fare', 'embarked', 'class', 'who', 'deck',
       'embark_town'],
      dtype='object')

In [105]:
titanic.index

RangeIndex(start=0, stop=891, step=1)

### Indexing

The default indexing mode for dataframes with `df[X]` is to access the DataFrame's *columns*:

In [106]:
titanic[['sex', 'age', 'class']].head()

      sex   age  class
0    male  22.0  Third
1  female  38.0  First
2  female  26.0  Third
3  female  35.0  First
4    male  35.0  Third

#### Using the `iloc` helper for indexing

In [107]:
titanic.head(3)

   survived     sex   age     fare embarked  class    who deck  embark_town
0         0    male  22.0   7.2500        S  Third    man  NaN  Southampton
1         1  female  38.0  71.2833        C  First  woman    C    Cherbourg
2         1  female  26.0   7.9250        S  Third  woman  NaN  Southampton

In [108]:
titanic.iloc

In [109]:
titanic.iloc[0]

survived                 0
sex                   male
age                     22
fare                  7.25
embarked                 S
class                Third
who                    man
deck                   NaN
embark_town    Southampton
Name: 0, dtype: object

In [110]:
titanic.iloc[0:5]

   survived     sex   age     fare embarked  class    who deck  embark_town
0         0    male  22.0   7.2500        S  Third    man  NaN  Southampton
1         1  female  38.0  71.2833        C  First  woman    C    Cherbourg
2         1  female  26.0   7.9250        S  Third  woman  NaN  Southampton
3         1  female  35.0  53.1000        S  First  woman    C  Southampton
4         0    male  35.0   8.0500        S  Third    man  NaN  Southampton

In [111]:
titanic.iloc[ [0, 10, 1, 5] ]

    survived     sex   age     fare embarked  class    who deck  embark_town
0          0    male  22.0   7.2500        S  Third    man  NaN  Southampton
10         1  female   4.0  16.7000        S  Third  child    G  Southampton
1          1  female  38.0  71.2833        C  First  woman    C    Cherbourg
5          0    male   NaN   8.4583        Q  Third    man  NaN   Queenstown

In [112]:
titanic.iloc[10:15]['age']

10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
Name: age, dtype: float64

In [113]:
titanic.iloc[10:15][  ['age'] ]

     age
10   4.0
11  58.0
12  20.0
13  39.0
14  14.0

#### Sorting and ordering data

In [114]:
titanic.head()

   survived     sex   age     fare embarked  class    who deck  embark_town
0         0    male  22.0   7.2500        S  Third    man  NaN  Southampton
1         1  female  38.0  71.2833        C  First  woman    C    Cherbourg
2         1  female  26.0   7.9250        S  Third  woman  NaN  Southampton
3         1  female  35.0  53.1000        S  First  woman    C  Southampton
4         0    male  35.0   8.0500        S  Third    man  NaN  Southampton

The `sort_index` method is designed to sort a DataFrame by either its index or its columns:

In [115]:
titanic.sort_index(ascending=False).head()

     survived     sex   age   fare embarked   class    who deck  embark_town
890         0    male  32.0   7.75        Q   Third    man  NaN   Queenstown
889         1    male  26.0  30.00        C   First    man    C    Cherbourg
888         0  female   NaN  23.45        S   Third  woman  NaN  Southampton
887         1  female  19.0  30.00        S   First  woman    B  Southampton
886         0    male  27.0  13.00        S  Second    man  NaN  Southampton

Since the Titanic index is already sorted, it's easier to illustrate how to use it for the index with a small test DF:

In [116]:
df = pd.DataFrame([1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150], columns=['A'])
df

     A
100  1
29   2
234  3
1    4
150  5

In [117]:
df.sort_index() # same as df.sort_index('index')

     A
1    4
29   2
100  1
150  5
234  3

Pandas also makes it easy to sort on the *values* of the DF:

In [118]:
titanic.sort_values('age', ascending=True).head()

     survived     sex   age     fare embarked   class    who deck  embark_town
803         1    male  0.42   8.5167        C   Third  child  NaN    Cherbourg
755         1    male  0.67  14.5000        S  Second  child  NaN  Southampton
644         1  female  0.75  19.2583        C   Third  child  NaN    Cherbourg
469         1  female  0.75  19.2583        C   Third  child  NaN    Cherbourg
78          1    male  0.83  29.0000        S  Second  child  NaN  Southampton

And we can sort on more than one column in a single call:

In [119]:
titanic.sort_values(['survived', 'age'], ascending=[True, True]).head()

     survived     sex  age     fare embarked  class    who deck  embark_town
164         0    male  1.0  39.6875        S  Third  child  NaN  Southampton
386         0    male  1.0  46.9000        S  Third  child  NaN  Southampton
7           0    male  2.0  21.0750        S  Third  child  NaN  Southampton
16          0    male  2.0  29.1250        Q  Third  child  NaN   Queenstown
119         0  female  2.0  31.2750        S  Third  child  NaN  Southampton

*Note:* both the index and the columns can be named:

In [120]:
t = titanic.sort_values(['survived', 'age'], ascending=[True, False])
t.index.name = 'id'
t.columns.name = 'attributes'
t.head()

attributes,survived,sex,age,fare,embarked,class,who,deck,embark_town
id,,,,,,,,,
851,0,male,74.0,7.7750,S,Third,man,NaN,Southampton
96,0,male,71.0,34.6542,C,First,man,A,Cherbourg
493,0,male,71.0,49.5042,C,First,man,NaN,Cherbourg
116,0,male,70.5,7.7500,Q,Third,man,NaN,Queenstown
672,0,male,70.0,10.5000,S,Second,man,NaN,Southampton

#### Grouping data

In [121]:
sex_class = titanic.groupby(['sex', 'class'])

What is a GroubBy object?

In [122]:
sex_class

In [123]:
from IPython.display import display

for name, group in sex_class:
    print('name:', name, '\ngroup:\n')
    display(group.head(2))

name: ('female', 'First')
group:

attributes,survived,sex,age,fare,embarked,class,who,deck,embark_town
1,1,female,38.0,71.2833,C,First,woman,C,Cherbourg
3,1,female,35.0,53.1000,S,First,woman,C,Southampton

name: ('female', 'Second')
group:

attributes,survived,sex,age,fare,embarked,class,who,deck,embark_town
9,1,female,14.0,30.0708,C,Second,child,NaN,Cherbourg
15,1,female,55.0,16.0000,S,Second,woman,NaN,Southampton

name: ('female', 'Third')
group:

attributes,survived,sex,age,fare,embarked,class,who,deck,embark_town
2,1,female,26.0,7.9250,S,Third,woman,NaN,Southampton
8,1,female,27.0,11.1333,S,Third,woman,NaN,Southampton

name: ('male', 'First')
group:

attributes,survived,sex,age,fare,embarked,class,who,deck,embark_town
6,0,male,54.0,51.8625,S,First,man,E,Southampton
23,1,male,28.0,35.5000,S,First,man,A,Southampton

name: ('male', 'Second')
group:

attributes  survived   sex   age  fare embarked   class  who deck  embark_town
17                 1  male   NaN  13.0        S  Second  man  NaN  Southampton
20                 0  male  35.0  26.0        S  Second  man  NaN  Southampton

name: ('male', 'Third')
group:

attributes  survived   sex   age  fare embarked  class  who deck  embark_town
0                  0  male  22.0  7.25        S  Third  man  NaN  Southampton
4                  0  male  35.0  8.05        S  Third  man  NaN  Southampton

In [124]:
sex_class.get_group(('female', 'Second')).head()

attributes,survived,sex,age,fare,embarked,class,who,deck,embark_town
9,1,female,14.0,30.0708,C,Second,child,NaN,Cherbourg
15,1,female,55.0,16.0000,S,Second,woman,NaN,Southampton
41,0,female,27.0,21.0000,S,Second,woman,NaN,Southampton
43,1,female,3.0,41.5792,C,Second,child,NaN,Cherbourg
53,1,female,29.0,26.0000,S,Second,woman,NaN,Southampton

The GroubBy object has a number of aggregation methods that will then compute summary statistics over the group members, e.g.:

In [125]:
sex_class.count()

attributes     survived  age  fare  embarked  who  deck  embark_town
sex    class
female First         94   85    94        92   94    81           92
       Second        76   74    76        76   76    10           76
       Third        144  102   144       144  144     6          144
male   First        122  101   122       122  122    94          122
       Second       108   99   108       108  108     6          108
       Third        347  253   347       347  347     6          347

#### Why Kate Winslett survived and Leonardo DiCaprio didn't

In [126]:
sex_class.mean()[['survived']]

attributes     survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

#### Of the females who were in first class, count the number from each embarking town

In [127]:
sex_class.get_group(('female', 'First')).groupby('embark_town').count()

attributes   survived  sex  age  fare  embarked  class  who  deck
embark_town
Cherbourg          43   43   38    43        43     43   43    35
Queenstown          1    1    1     1         1      1    1     1
Southampton        48   48   44    48        48     48   48    43

Since `count` counts non-missing data, we're really interested in the maximum value for each row, which we can obtain directly:

In [128]:
sex_class.get_group(('female', 'First')).groupby('embark_town').count().max('columns')

embark_town
Cherbourg      43
Queenstown      1
Southampton    48
dtype: int64

#### Cross-tabulation

In [129]:
pd.crosstab(titanic.survived, titanic['class'])

class     First  Second  Third
survived
0            80      97    372
1           136      87    119

#### We can also get multiple summaries at the same time

The `agg` method is the most flexible, as it allows us to specify directly which functions we want to call, and where:

In [130]:
def my_func(x):
    return np.max(x)

In [131]:
mapped_funcs = {'embarked': 'count', 
                'age': ('mean', 'median', my_func), 
                'survived': sum}

sex_class.get_group(('female', 'First')).groupby('embark_town').agg(mapped_funcs)

            embarked        age                survived
               count       mean median my_func      sum
embark_town
Cherbourg         43  36.052632   37.0    60.0       42
Queenstown         1  33.000000   33.0    33.0        1
Southampton       48  32.704545   33.0    63.0       46